# ToRoom Property (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Panel..::..ToRoom Property
Panel Class See Also
---
The "To Room" set for the door or window.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ToRoom | The "To Room" set for the door or window in the last phase of the project. (Inherited from FamilyInstance.) |
| [ToRoom[([( Phase])]) ](94e34f74-b6d1-2e4b-df44-b93aac5543c6.md "ToRoom Property \(Phase\)") | (Inherited from FamilyInstance.) |

# See Also
Panel Class
Panel Members
Autodesk.Revit.DB Namespace